#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

data.discord_color.marshmallow_pink: Reading...
data.discord_permission.basic_user: Reading...
data.discord_color.terraform_purple: Reading...
discord_server.server: Refreshing state... [id=983673922803347516]
data.discord_permission.basic_user: Read complete after 0s [id=4198072037]
data.discord_color.marshmallow_pink: Read complete after 0s [id=16731765]
data.discord_color.terraform_purple: Read complete after 0s [id=8405193]
discord_category_channel.general: Refreshing state... [id=984530248379031562]
module.add_rudi.data.discord_member.user_by_username: Reading...
discord_role.basic_user_role: Refreshing state... [id=984491811378704458]
discord_role.moderator: Refreshing state... [id=984491775991369728]
module.add_jodu.data.discord_member.user_by_username: Reading...
module.add_xenofon.data.discord_member.user_by_username: Reading...
discord_text_channel.welcome: Refreshing state... [id=984530249121415208]
module.add_rudi.data.discord_member.user_by_username: Read complete after 1s [id=334405573523144706]
module.add_xenofon.data.discord_member.user_by_username: Read complete after 1s [id=691726339417440338]
module.add_xenofon.discord_member_roles.basic_user: Refreshing state... [id=3524616678]
module.add_xenofon.discord_message.welcome_message: Refreshing state... [id=984535400720777236]
module.add_jodu.discord_message.welcome_message: Refreshing state... [id=984533995209523252]
module.add_jodu.data.discord_member.user_by_username: Read complete after 1s [id=984528458526904381]
module.add_jodu.discord_member_roles.basic_user: Refreshing state... [id=2613935418]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.add_rudi.discord_member_roles.basic_user will be created
  + resource "discord_member_roles" "basic_user" {
      + id        = (known after apply)
      + server_id = "983673922803347516"
      + user_id   = "334405573523144706"

      + role {
          + has_role = true
          + role_id  = "984491811378704458"
        }
    }

  # module.add_rudi.discord_message.welcome_message will be created
  + resource "discord_message" "welcome_message" {
      + author           = (known after apply)
      + channel_id       = "984530249121415208"
      + edited_timestamp = (known after apply)
      + id               = (known after apply)
      + pinned           = false
      + server_id        = (known after apply)
      + timestamp        = (known after apply)
      + tts              = false
      + type             = (known after apply)

      + embed {
          + title = "Welcome to the club Rudi!"

          + fields {
              + inline = false
              + name   = "Username:"
              + value  = "Rudi"
            }

          + footer {
              + text = "Say hello and have a look around!"
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rudikershaw, Action: `pull_request`*